In [1]:
#read csv file
import pandas as pd
df=pd.read_csv('baseball.csv',index_col=0)
df

                Team        Position  Height  Weight    Age PosCategory
Name
Adam_Donachie    BAL         Catcher      74     180  22.99     Catcher
Paul_Bako        BAL         Catcher      74     215  34.69     Catcher
Ramon_Hernandez  BAL         Catcher      72     210  30.78     Catcher
Kevin_Millar     BAL   First_Baseman      72     210  35.43   Infielder
Chris_Gomez      BAL   First_Baseman      73     188  35.71   Infielder
...              ...             ...     ...     ...    ...         ...
Brad_Thompson    STL  Relief_Pitcher      73     190  25.08     Pitcher
Tyler_Johnson    STL  Relief_Pitcher      74     180  25.73     Pitcher
Chris_Narveson   STL  Relief_Pitcher      75     205  25.19     Pitcher
Randy_Keisler    STL  Relief_Pitcher      75     190  31.01     Pitcher
Josh_Kinney      STL  Relief_Pitcher      73     195  27.92     Pitcher

[1015 rows x 6 columns]

# Hierarchial Indexing

In [3]:
#create hierarchical index
df1=df.head(5)
df1.stack()

Name
Adam_Donachie    Team                     BAL
                 Position             Catcher
                 Height                    74
                 Weight                   180
                 Age                    22.99
                 PosCategory          Catcher
Paul_Bako        Team                     BAL
                 Position             Catcher
                 Height                    74
                 Weight                   215
                 Age                    34.69
                 PosCategory          Catcher
Ramon_Hernandez  Team                     BAL
                 Position             Catcher
                 Height                    72
                 Weight                   210
                 Age                    30.78
                 PosCategory          Catcher
Kevin_Millar     Team                     BAL
                 Position       First_Baseman
                 Height                    72
                 Weight                   210
                 Age                    35.43
                 PosCategory        Infielder
Chris_Gomez      Team                     BAL
                 Position       First_Baseman
                 Height                    73
                 Weight                   188
                 Age                    35.71
                 PosCategory        Infielder
dtype: object

In [4]:
#dissolve hierarchical index
df1.unstack()

             Name
Team         Adam_Donachie                BAL
             Paul_Bako                    BAL
             Ramon_Hernandez              BAL
             Kevin_Millar                 BAL
             Chris_Gomez                  BAL
Position     Adam_Donachie            Catcher
             Paul_Bako                Catcher
             Ramon_Hernandez          Catcher
             Kevin_Millar       First_Baseman
             Chris_Gomez        First_Baseman
Height       Adam_Donachie                 74
             Paul_Bako                     74
             Ramon_Hernandez               72
             Kevin_Millar                  72
             Chris_Gomez                   73
Weight       Adam_Donachie                180
             Paul_Bako                    215
             Ramon_Hernandez              210
             Kevin_Millar                 210
             Chris_Gomez                  188
Age          Adam_Donachie              22.99
             Paul_Bako                  34.69
             Ramon_Hernandez            30.78
             Kevin_Millar               35.43
             Chris_Gomez                35.71
PosCategory  Adam_Donachie            Catcher
             Paul_Bako                Catcher
             Ramon_Hernandez          Catcher
             Kevin_Millar           Infielder
             Chris_Gomez            Infielder
dtype: object

# Aggregation

In [12]:
#create group object
g=df1.groupby('Age')
g

In [13]:
#Iterate  over groups
for i,group in g:
    print(i,group)

22.99               Team Position  Height  Weight    Age PosCategory
Name
Adam_Donachie  BAL  Catcher      74     180  22.99     Catcher
30.78                 Team Position  Height  Weight    Age PosCategory
Name
Ramon_Hernandez  BAL  Catcher      72     210  30.78     Catcher
34.69           Team Position  Height  Weight    Age PosCategory
Name
Paul_Bako  BAL  Catcher      74     215  34.69     Catcher
35.43              Team       Position  Height  Weight    Age PosCategory
Name
Kevin_Millar  BAL  First_Baseman      72     210  35.43   Infielder
35.71             Team       Position  Height  Weight    Age PosCategory
Name
Chris_Gomez  BAL  First_Baseman      73     188  35.71   Infielder

# Aggregate Groups

In [14]:
g.sum()

       Height  Weight
Age
22.99      74     180
30.78      72     210
34.69      74     215
35.43      72     210
35.71      73     188

In [16]:
g.prod()

       Height  Weight
Age
22.99      74     180
30.78      72     210
34.69      74     215
35.43      72     210
35.71      73     188

In [17]:
g.mean()

       Height  Weight
Age
22.99      74     180
30.78      72     210
34.69      74     215
35.43      72     210
35.71      73     188

In [18]:
g.std()

       Height  Weight
Age
22.99     NaN     NaN
30.78     NaN     NaN
34.69     NaN     NaN
35.43     NaN     NaN
35.71     NaN     NaN

In [19]:
g.describe()

      Height                                         Weight                    \
       count  mean std   min   25%   50%   75%   max  count   mean std    min
Age
22.99    1.0  74.0 NaN  74.0  74.0  74.0  74.0  74.0    1.0  180.0 NaN  180.0
30.78    1.0  72.0 NaN  72.0  72.0  72.0  72.0  72.0    1.0  210.0 NaN  210.0
34.69    1.0  74.0 NaN  74.0  74.0  74.0  74.0  74.0    1.0  215.0 NaN  215.0
35.43    1.0  72.0 NaN  72.0  72.0  72.0  72.0  72.0    1.0  210.0 NaN  210.0
35.71    1.0  73.0 NaN  73.0  73.0  73.0  73.0  73.0    1.0  188.0 NaN  188.0


         25%    50%    75%    max
Age
22.99  180.0  180.0  180.0  180.0
30.78  210.0  210.0  210.0  210.0
34.69  215.0  215.0  215.0  215.0
35.43  210.0  210.0  210.0  210.0
35.71  188.0  188.0  188.0  188.0

# select columns from groups

In [21]:
g['Age'].sum()

Age
22.99    22.99
30.78    30.78
34.69    34.69
35.43    35.43
35.71    35.71
Name: Age, dtype: float64

In [22]:
g[['Age','Weight']].sum()

         Age  Weight
Age
22.99  22.99     180
30.78  30.78     210
34.69  34.69     215
35.43  35.43     210
35.71  35.71     188

# Transform values

In [26]:
# import math
# g.transform(math.log)

# Data  Export

In [28]:
#data as Numpy array
df.values

array([['BAL', 'Catcher', 74, 180, 22.99, 'Catcher'],
       ['BAL', 'Catcher', 74, 215, 34.69, 'Catcher'],
       ['BAL', 'Catcher', 72, 210, 30.78, 'Catcher'],
       ...,
       ['STL', 'Relief_Pitcher', 75, 205, 25.19, 'Pitcher'],
       ['STL', 'Relief_Pitcher', 75, 190, 31.01, 'Pitcher'],
       ['STL', 'Relief_Pitcher', 73, 195, 27.92, 'Pitcher']], dtype=object)

In [29]:
#save data as CSV file
df.to_csv('output.csv',sep=",")

In [34]:
#Format a dataframe as tabular string:
df1.to_string()

'                Team       Position  Height  Weight    Age PosCategory\nName                                                                  \nAdam_Donachie    BAL        Catcher      74     180  22.99     Catcher\nPaul_Bako        BAL        Catcher      74     215  34.69     Catcher\nRamon_Hernandez  BAL        Catcher      72     210  30.78     Catcher\nKevin_Millar     BAL  First_Baseman      72     210  35.43   Infielder\nChris_Gomez      BAL  First_Baseman      73     188  35.71   Infielder'

In [33]:
#convert  a dataframe to a dictionary:
df1.to_dict()

{'Team': {'Adam_Donachie': 'BAL',
  'Paul_Bako': 'BAL',
  'Ramon_Hernandez': 'BAL',
  'Kevin_Millar': 'BAL',
  'Chris_Gomez': 'BAL'},
 'Position': {'Adam_Donachie': 'Catcher',
  'Paul_Bako': 'Catcher',
  'Ramon_Hernandez': 'Catcher',
  'Kevin_Millar': 'First_Baseman',
  'Chris_Gomez': 'First_Baseman'},
 'Height': {'Adam_Donachie': 74,
  'Paul_Bako': 74,
  'Ramon_Hernandez': 72,
  'Kevin_Millar': 72,
  'Chris_Gomez': 73},
 'Weight': {'Adam_Donachie': 180,
  'Paul_Bako': 215,
  'Ramon_Hernandez': 210,
  'Kevin_Millar': 210,
  'Chris_Gomez': 188},
 'Age': {'Adam_Donachie': 22.99,
  'Paul_Bako': 34.69,
  'Ramon_Hernandez': 30.78,
  'Kevin_Millar': 35.43,
  'Chris_Gomez': 35.71},
 'PosCategory': {'Adam_Donachie': 'Catcher',
  'Paul_Bako': 'Catcher',
  'Ramon_Hernandez': 'Catcher',
  'Kevin_Millar': 'Infielder',
  'Chris_Gomez': 'Infielder'}}

In [35]:
#Save a dataframe as an Excel table:
df.to_excel('Output1.xlsx')